using System;
using System.Windows;


namespace Курсовая
{
    internal class WorkWithInterface:Window
    {
        private string _notifyAboutCodeEmail = "    Мы отправили 5-значный код на Email. Подтвердите, что почта принадлежит вам, чтобы обезопасить свою учётную запись. Код действует в течении 10 минут";
        public string NotifyAboutCodeEmail { get => _notifyAboutCodeEmail; }

        private string _notifyAboutReserveEmail = " Укажите резервную почту. Она поможет восстановить доступ, если не получится войти в аккаунт. Также на эту почту будут приходить уведомления о действиях, связанных с безопасностью аккаунта";
        public string NotificationAboutReserveEmail { get => _notifyAboutReserveEmail; }

        private string _notificationPassword = "Пароль должен содержать:" + Environment.NewLine + " • Минимум 8 элементов"
                + Environment.NewLine + " • Одну большую букву" + Environment.NewLine + " • Одну маленькую букву"
                + Environment.NewLine + " • Одну цифру" + Environment.NewLine + " • И содержать в себе символы (A,Z,a,z,0,9)";
        public string NotificationPassword { get => _notificationPassword;}

        private string _policy = " СОГЛАШЕНИЕ ДЛЯ ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ И ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ"+Environment.NewLine + 
            "   Присоединяясь к настоящему Соглашению и оставляя свои данные в Horizont, путем заполнения полей в Личном кабинете(регистрации), Пользователь:"+Environment.NewLine + 
            "1. Подтверждает, что все указанные им данные принадлежат лично ему;"+Environment.NewLine +
            "2. Подтверждает и признает, что им внимательно в полном объеме прочитано Соглашение и условия обработки его персональных данных, указываемых им в полях регистрации в Личном кабинете(регистрации), текст соглашения и условия обработки персональных данных ему понятны;" + Environment.NewLine +
            "3. Дает согласие на обработку Сайтом предоставляемых в составе информации персональных данных в целях заключения между ним и Сайтом настоящего Соглашения, а также его последующего исполнения;" + Environment.NewLine +
            "4. Выражает согласие с условиями обработки персональных данных без оговорок и ограничений." +Environment.NewLine + 
            "   Пользователь дает свое согласие на обработку его персональных данных, а именно совершение действий, предусмотренных <О персональных данных>, и подтверждает, что, давая такое согласие, он действует свободно, своей волей и в своем интересе."+Environment.NewLine + 
            "   Согласие Пользователя на обработку персональных данных является конкретным, информированным и сознательным."+Environment.NewLine + 
            "   Настоящее согласие Пользователя признается исполненным в простой письменной форме, на обработку следующих персональных данных: фамилии, имени, отчества; места пребывания(город, область); номерах телефонов; адресах электронной почты(E-mail)."+Environment.NewLine + 
            "   Пользователь, предоставляет Horizon право осуществлять следующие действия(операции) с персональными данными: сбор и накопление; хранение в течение установленных нормативными документами сроков хранения отчетности, но не менее года, с момента даты прекращения пользования услуг Пользователем; уточнение(обновление, изменение); использование; уничтожение; обезличивание; передача по требованию суда, в т.ч., третьим лицам, с соблюдением мер, обеспечивающих защиту персональных данных от несанкционированного доступа."+Environment.NewLine + 
            "   Указанное согласие действует бессрочно с момента предоставления данных и может быть отозвано Пользователем путем подачи заявления администрации сайта с указанием данных, определенных Закона «О персональных данных»."+Environment.NewLine + 
            "   Отзыв согласия на обработку персональных данных может быть осуществлен путем направления Пользователем соответствующего распоряжения в простой письменной форме на адрес электронной почты (E-mail) kirill10.01.2003@mail.ru"+Environment.NewLine + 
            "   Horizon имеет право вносить изменения в настоящее Соглашение.При внесении изменений в актуальной редакции указывается дата последнего обновления.Новая редакция Соглашения вступает в силу с момента ее размещения, если иное не предусмотрено новой редакцией Соглашения.";
        public string Policy { get => _policy; }

        private string _aboutApp = "    С Windows приложением «Horizon» вся информация о Вашей поездке всегда под рукой." + Environment.NewLine +
            "   *Планирование поездки: получайте актуальную информацию о расписании поездов и наличии свободных мест в режиме реального времени." + Environment.NewLine +
            "   *Оформление электронных проездных документов (билетов): оформляйте билеты всего за несколько шагов." + Environment.NewLine +
            "   *Личный кабинет: оцените преимущества использования личного кабинета." + Environment.NewLine +
            "   * Управление заказами: управляйте заказами в «Horizon» приложении." + Environment.NewLine +
            "   * Справочник пассажира: пользуйтесь необходимой справочной информацией." + Environment.NewLine +
            "   *Онлайн-табло: узнайте с какого пути отправится или куда прибудет Ваш поезд." + Environment.NewLine +
            "   А теперь тест на возраст: покупали ли вы когда-нибудь билеты на самолет в авиакассах? Да-да: раньше, чтобы купить билет, нужно было ехать в специальные «магазины», сверять с оператором рейсы и цены, ждать в очереди… Сегодня, слава Богу, все делается намного проще: вам понадобится интернет, банковская карта и гораздо меньше свободного времени." + Environment.NewLine +
            "   Основные плюсы:" + Environment.NewLine +
            "   *Удобный интерфейс и фильтры: выбор дат поездок, календарь цен (можно корректировать, если хочешь чуть-чуть сэкономить)" + Environment.NewLine +
            "   *Бесплатные приложения для Windows" + Environment.NewLine +
            "   *При выборе конкретного билета всплывают дополнительные данные: вид и возраст вашего самолета, среднее время задержек, расстояние между сиденьями, информация о багаже и.т.д." + Environment.NewLine +
            "   *Если в отпуск хочется, и даты уже назначены, и лететь в общем-то все равно куда, есть фишка свободного поиска: выбирайте даты, а сервис уже отфильтрует все предложения, какие есть на этот период.Можно сравнить по ценам, дальности перелета, интересности маршрута и выбрать для себя подходящий." + Environment.NewLine +
            "   * Приложение копит баллы за совершенные вами покупки, чем становится выгодным для частных путешественников: чем чаще летаете, тем больше баллов падает в копилку и впоследствии меняются на скидки." + Environment.NewLine +
            "   * Предлагает страховку от отмены рейса и других неблагоприятностей — это поможет в случае чего вернуть почти 100% цены билета" + Environment.NewLine +
            "   *Отличный сервис уведомлений: подскажет, что ваш рейс скоро и пора собирать чемоданы, что уже время выдвигаться в аэропорт, что начинается ваша регистрация — когда предвкушаешь поездку, на такие уведомления всегда реагируешь с улыбкой, да и забота приятна чисто по-человечески.";

        public string AboutAppHorizon { get => _aboutApp; }

        public string decode(string str) => encode(str);

        public string encode(string str)
        {
            string text = string.Empty;
            for (int i = 0; i < str.Length; i++)
            {
                if (str[i] >= 'a' && str[i] <= 'z')
                    text += Cipher(str[i], 'a', 'z');
                else if (str[i] >= 'A' && str[i] <= 'Z')
                    text += Cipher(str[i], 'A', 'Z');
                else if (str[i] >= '0' && str[i] <= '9')
                    text += Cipher(str[i], '0', '9');
            }
            return text;
        }

        private char Cipher(char letter, int firstLatter, int lastLatter) =>
            (char)(lastLatter - (letter - firstLatter));
    }
}
